Rails/meshiterro/app/controllers/post_comments_controller.rb

	def create
        post_image = PostImage.find(params[:post_image_id])
    	comment = current_user.post_comments.new(post_comment_params)
    	comment.post_image_id = post_image.id
    	comment.save!
---
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "post_comments" ("comment", "user_id", "post_image_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "aaaa"], ["user_id", 1], ["post_image_id", 2], ["created_at", "2020-04-08 10:22:10.651191"], ["updated_at", "2020-04-08 10:22:10.651191"]]