Rails/meshiterro/app/controllers/users_controller.rb

  def show
  	@user = User.find(params[:id])
    @post_images = @user.post_images.page(params[:page]).reverse_order
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "post_images".* FROM "post_images" WHERE "post_images"."user_id" = ? ORDER BY "post_images"."id" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 5], ["OFFSET", 0]]

  def update
  	@user = User.find(params[:id])
  	@user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", "e302082eaee91be42f1e0e2a3c92469af63307e461c92f40c0d5c3c051f8"], ["updated_at", "2020-04-09 09:50:00.413650"], ["id", 1]]