Rails/Bookers_app/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "user_id", "created_at", "updated_at", "body") VALUES (?, ?, ?, ?, ?)  [["title", "mk"], ["user_id", 2], ["created_at", "2020-04-12 08:44:17.541526"], ["updated_at", "2020-04-12 08:44:17.541526"], ["body", "mk\r\n"]]
SELECT "books".* FROM "books"
---
  def create
    book = Book.new(book_params)
    book.user_id = current_user.id
    if  book.save
      flash[:notice] = "You have creatad book successfully."
      redirect_to book_path(book.id)
    else
      @book = book
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @book = Book.new
    @book_show = Book.find(params[:id])

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", ""], ["body", ""], ["updated_at", "2020-04-12 10:25:56.896523"], ["id", 4]]
---
  def update
    book = Book.find(params[:id])
    if  book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def ensure_correct_user
    book = Book.find(params[:id])