Rails/Bookers_app/app/controllers/users_controller.rb

  def show
  	@book = Book.new
  	@user = User.find(params[:id])
  	@books = @user.books.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "books".* FROM "books" WHERE "books"."user_id" = ?  [["user_id", 5]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def update
  	user = User.find(params[:id])
  	if  user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "introduction" = ?, "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["introduction", ""], ["profile_image_id", "6f2fb2fcef9fdba16a8a53485abaa56b2eed8db52f2e34c69080f0c69586"], ["updated_at", "2020-04-12 09:02:23.807976"], ["id", 2]]

  def ensure_correct_user
    user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]