Rails/CARAVAN/app/controllers/blogs_controller.rb

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def update
    blog = Blog.find(params[:id])