Rails/Bookers/app/controllers/books_controller.rb

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "aaaaaaaaaaaaaaaaaaaaaaa"], ["body", "bbbbbbbbbbbbbb"], ["created_at", "2020-04-05 07:47:53.333114"], ["updated_at", "2020-04-05 07:47:53.333114"]]
SELECT "books".* FROM "books"
---
  def create
  	book = Book.new(book_params)
  	if book.save
      flash[:notice] = "Book was successfully created."
  	  redirect_to book_path(book.id)
    else
      @book = book
      @books = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "aaa"], ["body", "aaa"], ["updated_at", "2020-04-06 09:48:48.399636"], ["id", 14]]
---
  def update
    book = Book.find(params[:id])
    if book.update(book_params)