Rails/sample_app/app/controllers/todolists_controller.rb

INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["body", "railsの勉強"], ["created_at", "2020-04-04 04:48:17.616332"], ["updated_at", "2020-04-04 04:48:17.616332"]]
---
  def create
  	list = List.new(list_params)
  	list.save

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 2]]
---
  def destroy
    list = List.find(params[:id])
    list.destroy